{
  "data":[
    {
      "id":0,
      "date":"2021-12-08",
      "title":"개발 공부 시작!!",
      "title2":"노마드 코더 사이트를 통해 바닐라 JS 을 수강하였습니다.",
      "content": "제가 개발자를 진로로 정한 뒤 진지하게 개발공부를 처음 한 순간이었습니다. 비록 3학년 말이라는 늦은 시기에 공부를 시작하였지만 해당 강의를 들으면서 프로그래밍의 기본 중 기본인 데이터 타입, 배열, 객체, 반복문, 조건문에 대해 익힐 수 있는 시간이었습니다.",
      "gift": "개발 기초 지식, 자신감, 의욕, 이벤트 처리",
      "left": "100px",
      "web":["/js_info.jpg", "/js_complete.jpg", "/js_rdbg.jpg", "/js_timewatch.jpg"],
      "mobile":[]
    },
    {
      "id":1,
      "date":"2021-12-27",
      "title":"첫 개인작⭐️",
      "title2":"노마드 코더 바닐라 JS 챌린지 참여하여 우수 졸업생이 되었습니다",
      "content": "바닐라 JS 수강이 끝날 때쯤 챌린지에 참여하게 되어 강의에서 배운 내용들을 다시 복기하면서 주어진 기능들을 필수조건으로 하여 개인 웹사이트를 제작하는 미션이었습니다. 주어진 미션으로는 (사용자 입력, 랜덤 배열 출력, 날씨 API 이용, 투두리스트) 가 있었으며 여기서 저는 추가로 mp3기능, 그림판을 추가하였습니다. 이 프로젝트를 통하여 부족했던 html, css 실력의 향상도 있었으며 여러 예시들을 둘러보며 다른 사람의 코드를 분석하는 능력도 길러졌습니다. 열심히 하여 결과적으로 19기 우수 졸업생으로 뽑히게 되었습니다.",
      "gift": "학습 응용력, 코드 분석력, git, HTML/CSS 응용력, 우수 졸업생",
      "left": "200px",
      "web":["/mypad_2.jpg","/mypad_4.jpg"],
      "mobile":["/mypad_1.jpg","/mypad_3.jpg","/mypad_5.jpg"]
    },
    {
      "id":2,
      "date":"2021-12-29",
      "title":"첫 실습//",
      "title2":"대구 남구에 있는 투버미디어라는 곳으로 실습을 갔습니다.",
      "content": "실습을 가게 되어 실제 현장에서는 어떤 분위기인지 어떤 일을 하는지 관찰 할 수 있는 시간이 되었습니다. 해당 회사의 경우 실습생, 인턴에게는 php를 교육하고 있었으며 게시판의 중요성에 대해 배웠습니다. 담당 사수분들이 코드 분석을 요구하였지만 php언어의 숙련도가 매우 떨어져 급하게 php언어를 공부하게 되었습니다. 덕분에 현재 자신의 수준과 앞으로 익혀야 될 지식들이 어떤 것인지 방향을 잡을 수 있는 기회가 되었습니다.",
      "gift": "학습 방향성, 게시판 구현 원리, DB 기초",
      "left": "400px",
      "web":["/training_1.jpg", "/training_4.jpeg"],
      "mobile":["/training_2.jpeg","/training_3.jpeg"]
    },
    {
      "id":3,
      "date":"2021-02-25",
      "title":"PHP 공부",
      "title2":"실습 후 PHP를 과거 학교 수업자료와 생활코딩 강의를 통해 공부하였습니다.",
      "content": "당시 개발 시작의 트렌드나 현장에서 어떤 언어와 기술을 쓰는지 등의 배경지식이 없었기에 당장 실습 때 언급이 되었던 PHP에 대해 공부를 하기 시작하였습니다. PHP를 공부하면서 저의 주언어인 JS와 비교하면서 학습하였는데, 많은 유사점을 느끼며 기본적인 기능들을 구현하는 데 있어서는 어려움이 적었습니다.",
      "gift": "PHP, 서버 통신",
      "left": "600px",
      "web":["/php_1.jpg","/php_2.jpg","/php_3.jpg"],
      "mobile":[]
    },
    {
      "id":4,
      "date":"2022-03-02 ~ 2022-06-21",
      "title":"캡스톤 디자인2",
      "title2":"4-1학기 교내 캡스톤 디자인2 과목을 통해 팀프로젝트에서 구현 일정을 잡게 되었습니다.",
      "content": "3-2학기에 캡스톤 디자인1 수업을 통해 프로젝트 기획을 연결지어 프로젝트 구현을 진행하게 되었습니다. 막상 구현을 할려니 저를 포함해 팀원들 대부분 코딩에 자신이 없어 팀장인 제가 책임감을 느끼고 프로젝트를 이끌어 나갔습니다. 프로젝트의 주제는 흡연 구역 지도 웹/앱 이었고 해당 기능을 구현하기 위해 PHP를 메인언어로 사용하며 지도 기능을 구현하기 위해 kakao map API를 사용하였습니다. 또한 DB로는 mysql을 사용하여 프로젝트 기간동안 SQL에 대해 공부를 많이 하는 시간이 되었습니다. 팀장으로서 막중한 책임을 가지고 열심히 하여 결과적으로 전체 팀 중 가장 호평을 받으며 성공적으로 프로젝트를 마쳤습니다.",
      "gift": "PHP, SQL, AJAX, 비동기 통신, 채팅 기능 구현(롱 폴링), Session, Kakao map API, 일반 사용자와 관리자 구분,성취감, 팀장으로서 역할",
      "left": "900px",
      "web":["/sa_4.jpg","/sa_7.jpg","/sa_10.jpg"],
      "mobile":["/sa_1.jpg", "/sa_2.jpg","/sa_3.jpg","/sa_5.jpg","/sa_6.jpg","/sa_8.jpg","/sa_9.jpg"]
    },
    {
      "id":5,
      "date":"2022-07-20 ~ 2022-12-15",
      "title":"SW인재양성교육 참여",
      "title2":"교내 공고를 통해 SW인재양성교육에 참여하게 되었습니다.",
      "content": "웹 프론트 / 백 개발자 모집 공고였습니다. 교육 커리큘럼으로는 제가 관심있던 React와 nodeJS가 있어 참여하게 되었습니다. 약 4주간의 프론트 교육 그리고 4주간의 백 교육을 통해 여러 교육들을 받아 HTML,CSS,JS 기초 React, firebase, redux, nodejs, JSP, Oracle, open API, AJAX에 대해 익히는 시간이 되었습니다. 기존에 알던 것들도 있었지만 해당 교육을 통해 부족한 부분들이 채워지고 새로운 것들을 알게 되어 좋은 시간이었습니다. 또한, 다른 교육생들과 같이 진행하면서 notion에 대해서도 알게 되었고 못 따라가는 부분들은 친구들의 도움을 받을 수 있어 힘이 되었습니다. 마지막으로 교육 후반기에는 adobe 디자인 툴에 대해 배웠습니다. 저의 경우 과거 포토샵 공부를 하여 디자인 툴을 다시 익히는 데 있어 이점이 있었습니다.",
      "gift": "React, Redux, Firebase, NodeJS, JSP, Oracle, OpenAPI, adobe design tool(PS, AI, XD), 동료애",
      "left": "1300px",
      "web":[],
      "mobile":["/poster.jpeg"]
    },
    {
      "id":6,
      "date":"2022-10-06",
      "title":"개인프로젝트",
      "title2":"SW인재양성교육을 통해 개인프로젝트를 진행하였습니다.",
      "content": "이전에 해봤던 캡스톤과는 달리 시간이 거의 1주일이라는 매우 짧은 기간동안 프로젝트를 진행하게 되었습니다. 때문에, 멘토님들은 코딩을 줄이고 기획에 많이 투자하라 하셨지만, 저의 경우 다른 교육생에 비해 기획에 비교적 능숙하여 금방 끝내고 개발을 진행하였습니다. 프론트의 경우 React 백은 Express DB는 mariaDB를 이용하였습니다. Expresss는 이때, 처음 써보았는데 PHP와는 굉장히 다르게 느껴졌고 또한 api를 만드는 개념을 처음 접하였습니다. 개발 기능은 공간 예약 플랫폼으로 로그인한 유저에 한해 플랫폼에 등록된 장소들을 지정된 시간 중 선택하여 예약을 할 수 있도록 하였습니다. 이 프로젝트를 통해 단 기간내 기획했던 내용 전부를 구현하게 되어 교육생들 중 가장 완성도 있게 만들어 개인프로젝트 부문에서 1등을 수상하게 되었습니다.",
      "gift": "Express, react module사용, 기획력, 1등",
      "left": "1600px",
      "web":["/rb_1.jpg","/rb_2.jpg","/rb_3.jpg","/rb_4.jpg","/rb_5.jpg"],
      "mobile":[]
    },
    {
      "id":7,
      "date":"2022-10-18 ~ 2022-12-02",
      "title":"팀프로젝트",
      "title2":"SW인재양성교육을 통해 기업과 함께 팀프로젝트를 진행하였습니다.",
      "content": "기업의 주제에 맞춰 팀프로젝트를 진행하게 되었습니다. 저희 팀프로젝트의 주제는 자유주제로 모바일 플랫폼 개발이었는데, 첫 주에 기업에서 제공하는 프레임워크인 Mopheus교육과, 자바 스프링 교육을 진행하였지만, 갑작스러운 장소 이동과 인터넷 문제, 앱 개발 등 교육에 차질이 있었지만, 팀원들과 최대한 프로젝트를 진행한 덕분에 늘 프로젝트를 진행하던 저에게는 팀원과의 협업에 대해 체험하는 기회가 되었습니다. 이 과정에서 팀원들과의 의사소통이 잘 안되어 프로젝트 진행에 일정이 늦춰지긴 했지만 계획하고 있던 부분에 대해서는 대부분 구현을 완료하였습니다. 이 프로젝트의 경우 팀원들의 프로그래밍 능력이 많이 부족하여 공부하는 시간이 많이 되어 저는 프로그래밍에 관한 능력발전에 있어서는 성장이 별로 안되었지만 팀장으로서 팀원들이 프로그래밍하는 데 있어 헷갈리지 않고 작업할 수 있도록 프로젝트 구조 정리, 규칙 공지, 작업 일정 문서화, 깃을 통한 팀 작업을 하면서 코딩 외적인 부분에서 많이 배우는 시간이 되었습니다. 또한, 백엔드를 mongoDB로 구성하면서 처음 NoSQL을 접하게 되었고 코드를 모듈화 하여 구조적으로 완성도 있게 하였습니다. 프로젝트가 끝난 후 아쉬운 점으로는 기업에서 제공하는 Mopheus 프레임워크를 적용시키지 못한 것입니다.",
      "gift": "협업 능력, MongoDB, Mongoose, Modularization, 문서화, 깃 버전 관리",
      "left": "1800px",
      "web":[],
      "mobile":["/team1.png","/team2.png","/team3.png","/team4.png","/team5.png","/team6.png","/team7.png","/team8.png","/team9.png","/team10.png","/team11.png","/team12.png","/team13.png","/team14.png"]
    },
    {
      "id":8,
      "date":"2022-12-03 ~ 2022-12-09",
      "title":"Dart언어 공부",
      "title2":"노마드 코더 사이트를 통해 Dart언어를 공부했습니다.",
      "content": "팀 프로젝트를 진행하면서 앱에 관심이 생겼고 이왕이면 웹뷰를 통한 앱보다는 네이티브 앱을 만들고 싶어 알아보다 '플러터'에 관심이 생겼습니다. 플러터에서 사용하는 언어인 Dart에 대해 흥미가 생겨 공부를 시작하게 되었습니다. Dart의 경우 제가 자신있어하는 JS보다는 Java와 같은 컴파일 언어와 문법이 비슷하여 조금 어려움이 있어 이후에도 추가적인 공부가 필요할 것 같습니다. 저의 경우 컴퓨터공학과를 전공했음에도 늦게 개발공부를 시작하여 C++, Java와 같은 언어들을 어려워하는데 이번 Dart언어를 공부하면서 간접적으로 익힐 수 있는 기회가 되어 나중에 다시 Java를 공부해야겠다는 의욕이 생기는 시간이었습니다.",
      "gift": "Dart 기초, 컴파일 언어에 대한 학습의욕",
      "left": "2100px",
      "web":[],
      "mobile":[]
    },
    {
      "id":9,
      "date":"2021-12-13 ~ 2022-12-14",
      "title":"웹 포트폴리오",
      "title2":"웹 포트폴리오",
      "content": "앞으로의 취업시장에 뛰어 들기 위해 저에 대해 소개하는 웹 포트폴리오 및 이력서를 만들었습니다. 웹 포트폴리오의 경우 SW인재양성교육 기간동안 간간히 혼자 공부해 오던 Next.js를 통해 구현하였지만 익숙치 않고 아직 더 공부해야겠다는 생각이 듭니다. ",
      "gift": "나를 정리, NextJS, 포트폴리오, 이력서",
      "left": "2200px",
      "web":[],
      "mobile":[]
    },
    {
      "id":10,
      "date":"after...",
      "title":"추후 일정",
      "title2":"추후 일정",
      "content": "부족함을 많이 느끼고 앞으로도 구직 활동과는 관계 없이 계속 공부를 할 예정입니다. 이후 학습의 일정으로는 'Dart','Flutter','React Native','NestJS','NextJS','Java','Python','Spring boot' 등 이 있습니다.",
      "gift": "미래 계획",
      "left": "2300px",
      "web":[],
      "mobile":[]
    }
  ]
}